In [7]:
import pandas as pd

In [10]:
 
n = 3
Sample_1 = [57, 51, 6] 
Sample_2 = [92, 16, 19] 
Sample_3 = [15, 93, 71] 
Sample_4 = [28, 73, 31] 
  
sample_id = zip(["S"]*n, list(range(1, n + 1))) 
  
s_names = [''.join([w[0], str(w[1])]) for w in sample_id] 
  
d = {'s_names': s_names, 'Sample_1': Sample_1,  
     'Sample_2': Sample_2, 'Sample_3': Sample_3, 
     'Sample_4': Sample_4} 
mapping = {'Sample_1': 'Result_1', 
           'Sample_2': 'Result_1',  
           'Sample_3': 'Result_2',  
           'Sample_4': 'Result_2'} 
  
df_1 = pd.DataFrame(d) 
df_1

  s_names  Sample_1  Sample_2  Sample_3  Sample_4
0      S1        57        92        15        28
1      S2        51        16        93        73
2      S3         6        19        71        31

In [28]:
df=df_1.set_index('s_names').groupby(mapping,axis=1).sum()
df.reset_index()

C:\Users\soumy\AppData\Local\Temp\ipykernel_6844\44450846.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  df=df_1.set_index('s_names').groupby(mapping,axis=1).sum()

  s_names  Result_1  Result_2
0      S1       149        43
1      S2        67       166
2      S3        25       102

In [29]:
df = pd.DataFrame({'First': ['Manan ', 'Raghav ', 'Sunny '], 
                   'Last': ['Goel', 'Sharma', 'Chawla'], 
                   'Age':[12, 24, 56]}) 
  
mapping = {'First': 'Full Name', 'Last': 'Full Name'}
df

     First    Last  Age
0   Manan     Goel   12
1  Raghav   Sharma   24
2   Sunny   Chawla   56

In [33]:
mapping

{'First': 'Full Name', 'Last': 'Full Name'}

In [31]:
df.set_index('Age')

       First    Last
Age
12    Manan     Goel
24   Raghav   Sharma
56    Sunny   Chawla

In [37]:
df.set_index('Age').groupby(mapping,axis=1).sum().reset_index()

C:\Users\soumy\AppData\Local\Temp\ipykernel_6844\2855951199.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  df.set_index('Age').groupby(mapping,axis=1).sum().reset_index()

   Age      Full Name
0   12     Manan Goel
1   24  Raghav Sharma
2   56   Sunny Chawla